;; -*- no-byte-compile: t; -*-
;;; .doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:host github :repo "username/repo"))
;; (package! builtin-package :disable t)

;; Linux
(package! exwm)


(package! org-super-agenda)
(package! browse-kill-ring)
(package! org-download)
(package! ox-hugo)
(package! shrface)
(package! counsel-org-clock)
(package! olivetti)
(package! writeroom-mode)
;;(package! mathpix.el :recipe (:host github :repo "jethrokuan/mathpix.el"))
;;(package! dap-mode)
;; (package! visual-fill-column :recipe
;;  (:host nil :repo "https://codeberg.org/joostkremers/visual-fill-column"))
